[
  "table-editor-obsidian",
  "dataview",
  "templater-obsidian",
  "obsidian-kanban",
  "obsidian-outliner",
  "obsidian-emoji-toolbar",
  "obsidian-mind-map",
  "folder-note-plugin",
  "obsidian-commits",
  "obsidian-activity-history"
]